Repository: tizenorg/platform.upstream.snapper
Catalog: po/*.po
Languages: de

source: --cleanup-algorithm, -c <algo> Cleanup algorithm for snapshot.
de: --cleanup-algorithm, -c <algo> Bereinigungsalgorithmus für den Snapshot.

source: --command <command> Run command and create pre and post snapshots.
de: --command <Kommando> Kommando ausführen und Pre- und Post-Snapshots erstellen.

source: --config, -c <name> Set name of config to use.
de: --config, -c <Name> Zu verwendende Konfiguration festlegen.

source: --description, -d <description> Description for snapshot.
de: --description, -d <Beschreibung> Beschreibung des Snapshots.

source: --fstype, -f <fstype> Manually set filesystem type.
de: --fstype, -f <Dateisystemtyp> Dateisystemtyp manuell festlegen.

source: --input, -i <file> Read files for which to undo changes from file.
de: --input, -i <Datei> Dateien lesen, in denen Änderungen aus Datei rückgängig gemacht werden sollen.

source: --output, -o <file> Save status to file.
de: --output, -o <Datei> Status in <Datei> speichern.

source: --pre-number <number> Number of corresponding pre snapshot.
de: --pre-number <Nummer> Nummer des entsprechenden Vor-Snapshots.

source: --print-number, -p Print number of created snapshot.
de: --print-number, -p Nummer des erstellten Snapshots anzeigen.

source: --quiet, -q Suppress normal output.
de: --quiet, -q Normale Ausgabe unterdrücken.

source: --table-style, -t <style> Table style (integer).
de: --table-style, -t <Stil> Tabellenstil (Ganzzahl).

source: --template, -t <name> Name of config template to use.
de: --template, -t <Name> Name der zu verwendenden Konfigurationsvorlage.

source: --type, -t <type> Type for snapshot.
de: --type, -t <Typ> Snapshot-Typ.

source: --type, -t <type> Type of snapshots to list.
de: --type, -t <Typ> Typ der aufzulistenden Snapshots.

source: --userdata, -u <userdata> Userdata for snapshot.
de: --userdata, -u <userdata> Anwenderdaten für den Snapshot.

source: --verbose, -v Increase verbosity.
de: --verbose, -v Ausführlichkeit erhöhen.

source: --version Print version and exit.
de: --version Version anzeigen und beenden.

source: snapper cleanup <cleanup-algorithm>
de: snapper cleanup <Bereinigungsalgorithmus>

source: snapper delete <number>
de: snapper delete <Nummer>

source: snapper diff <number1>..<number2> [files]
de: snapper diff <Nummer1>..<Nummer2> [Dateien]

source: snapper modify <number>
de: snapper modify <Nummer>

source: snapper mount <number>
de: snapper mount <Nummer>

source: snapper status <number1>..<number2>
de: snapper status <Nummer1>..<Nummer2>

source: snapper umount <number>
de: snapper umount <Nummer>

source: snapper undochange <number1>..<number2> [files]
de: snapper undochange <Nummer1>..<Nummer2> [Dateien]

source: Global options:
de: Globale Optionen:

source: Options for 'create' command:
de: Optionen für Kommando 'create':

source: Options for 'create-config' command:
de: Optionen für Kommando 'create-config':

source: Options for 'list' command:
de: Optionen für Kommando 'list':

source: Options for 'modify' command:
de: Optionen für Kommando 'modify':

source: Options for 'status' command:
de: Optionen für das Kommando 'status':

source: Options for 'undochange' command:
de: Optionen für Kommando 'undochange':

source: Cleanup snapshots:
de: Snapshots bereinigen:

source: Comparing snapshots:
de: Snapshots vergleichen:

source: Create config:
de: Konfiguration erstellen:

source: Create snapshot:
de: Snapshot erstellen:

source: Delete config:
de: Konfiguration löschen:

source: Delete snapshot:
de: Snapshot löschen:

source: List configs:
de: Konfigurationen auflisten:

source: List snapshots:
de: Snapshots auflisten:

source: Modify snapshot:
de: Snapshot ändern:

source: Mount snapshot:
de: Snapshot einhängen:

source: Umount snapshot:
de: Snapshot aushängen:

source: Undo changes:
de: Änderungen rückgängig machen:

source: Cleanup
de: Bereinigen

source: Command 'cleanup' needs one arguments.
de: Das Kommando 'cleanup' benötigt ein Argument.

source: Command 'create' does not take arguments.
de: Das Kommando 'create' akzeptiert keine Argumente.

source: Command 'create-config' needs one argument.
de: Das Kommando 'create-config' benötigt ein Argument.

source: Command 'debug' does not take arguments.
de: Kommando 'debug' akzeptiert keine Argumente.

source: Command 'delete' needs at least one argument.
de: Das Kommando 'delete' benötigt mindestens ein Argument.

source: Command 'delete-config' does not take arguments.
de: Kommando 'delete-config' akzeptiert keine Argumente.

source: Command 'diff' needs at least one argument.
de: Kommando 'diff' braucht mindestens ein Argument.

source: Command 'help' does not take arguments.
de: Das Kommando 'help' akzeptiert keine Argumente.

source: Command 'list' does not take arguments.
de: Das Kommando 'list' akzeptiert keine Argumente.

source: Command 'list-configs' does not take arguments.
de: Das Kommando 'list-configs' akzeptiert keine Argumente.

source: Command 'modify' needs at least one argument.
de: Kommando 'modify' benötigt mindestens ein Argument.

source: Command 'mount' needs at least one argument.
de: Das Kommando 'mount' benötigt mindestens ein Argument.

source: Command 'status' needs one argument.
de: Kommando 'status' erfordert ein Argument.

source: Command 'undochange' needs at least one argument.
de: Das Kommando 'undochange' benötigt mindestens ein Argument.

source: Config
de: Konfiguration

source: Config is in use.
de: Die Konfiguration wird bereits verwendet.

source: Config is locked.
de: Die Konfiguration ist gesperrt.

source: Creating config failed (%s).
de: Erstellung der Konfiguration fehlgeschlagen (%s).

source: Creating snapshot failed.
de: Fehler beim Erstellen des Snapshots.

source: Date
de: Datum

source: Deleting config failed (%s).
de: Fehler beim Löschen der Konfiguration (%s).

source: Deleting snapshot failed.
de: Fehler beim Löschen des Snapshots.

source: Description
de: Beschreibung

source: Detecting filesystem type failed.
de: Erkennung des Dateisystemtyps fehlgeschlagen.

source: Failure
de: Fehler

source: File '%s' not found.
de: Datei '%s' wurde nicht gefunden.

source: IO Error.
de: Ein-/Ausgabefehler.

source: Identical snapshots.
de: Identische Snapshots.

source: Illegal Snapshot.
de: Ungültiger Snapshot.

source: Invalid snapshot '%s'.
de: Snapshot '%s' ist ungültig.

source: Invalid snapshots.
de: Ungültige Snapshots.

source: Invalid subvolume.
de: Ungültiges Subvolume.

source: Invalid table style %d.
de: Ungültiger Tabellenstil %d.

source: Invalid userdata.
de: Ungültige Benutzerdaten.

source: Missing argument for command option '%s'.
de: Argument für Kommandooption '%s' fehlt.

source: Missing argument for global option '%s'.
de: Argument für globale Option '%s' fehlt.

source: Missing command argument.
de: Fehlendes Kommandoargument.

source: Missing or invalid pre-number.
de: Nummer des Vor-Snapshots fehlt oder ist ungültig.

source: No command provided.
de: Kein Kommando bereitgestellt.

source: No permissions.
de: Keine Berechtigungen.

source: Opening file '%s' failed.
de: Öffnen von Datei '%s' fehlgeschlagen.

source: Post #
de: Nach #

source: Post Date
de: Nach-Datum

source: Pre #
de: Vor #

source: Pre Date
de: Vor-Datum

source: Snapshot is in use.
de: Der Snapshot wird bereits verwendet.

source: Try 'snapper --help' for more information.
de: Versuchen Sie 'snapper --help' für weitere Informationen.

source: Type
de: Typ

source: Unknown cleanup algorithm '%s'.
de: Unbekannter Bereinigungsalgorithmus '%s'.

source: Unknown command '%s'.
de: Unbekanntes Kommando '%s'.

source: Unknown config.
de: Unbekannte Konfiguration.

source: Unknown file.
de: Unbekannte Datei.

source: Unknown global option '%s'.
de: Unbekannte globale Option '%s'.

source: Unknown option '%s' for command '%s'.
de: Unbekannte Option '%s' für Kommando '%s'.

source: Unknown type of snapshot.
de: Unbekannter Snapshottyp.

source: Unknown type of snapshots.
de: Unbekannter Snapshottyp.

source: Use an integer number from %d to %d
de: Geben Sie eine Ganzzahl von %d bis %d ein

source: User
de: Benutzer

source: Userdata
de: Benutzerdaten

source: create:%d modify:%d delete:%d
de: angelegt:%d geändert:%d gelöscht:%d

source: creating %s
de: %s wird erstellt

source: deleting %s
de: %s wird gelöscht

source: failed to create %s
de: %s konnte nicht erstellt werden.

source: failed to delete %s
de: %s konnte nicht gelöscht werden.

source: failed to modify %s
de: %s konnte nicht geändert werden.

source: modifying %s
de: %s wird geändert

source: nothing to do
de: keine auszuführenden Aktionen

source: usage: snapper [--global-options] <command> [--command-options] [command-arguments]
de: Syntax: snapper [--Globale-Optionen] <Kommando> [--Kommandooptionen] [Kommandoargumente]
